Term3/discrete/hws/kr3.org
#+LATEX_CLASS: general
#+TITLE: Test #3
#+AUTHOR: Ilya Yaroshevskiy

* Test #3 (Случайные графы)
Модель $G(n, p)$, размер вероятностного пространства $2^{n \choose 2}$ \\
Вероятность графа из $m$ ребер $p^mq^{ {n \choose 2} - m}$ \\
Пороговая вероятность свойства $A$ графа $G(n, p)$ - $t(n)$
- $p(n) = o(t(n))$ - $A$ а.п.н не выполнятеся
- $p(n) = \omega(t(n))$ - $A$ а.п.н выполнятеся
** Метод 1 момента
\[ A = \{G \mid x \in G\} \]
/$x$ - например треугольники/ \\
$X$ - колтчество $x$ в графе $G$ \\
Если $EX \to 0$, то $A$ а.п.н не выполнено
** Метод 2 момента
$P(|X - EX| \ge EX) \le \frac{DX}{(EX)^2}$ \\
Если $EX \to \infty$, хотим чтобы $\frac{DX}{(EX)^2} \to 0$, 
если выполнено то $A$ а.п.н выполнено
\begin{gather*}
DX = E(X^2) - (EX)^2 \\
\frac{DX}{(EX)^2} = \frac{E(X^2) - (EX)^2}{(EX)^2} = \frac{E(X^2)}{(EX)^2} - 1 \\
E(X^2) = (EX)^2(1 + \underbrace{o(1)}_{\to 0})
\end{gather*}
** Распределение степеней вершин
Граница Чернова
/Пример нечестной монеты: 1 с вероятностью $p$, 0 с вероятностью $q$/ \\
/$pn$ - мат. ожидание количества единиц/
\[ P(|\xi - np| \ge \alpha\sqrt{np}) \le 3e^{-\frac{\alpha^2}{8}} \]
, где $\xi = \sum_{i=1}^n \xi_i,\ \xi_i = \begin{cases} 1, p \\ 0, q \end{cases}$

$p = const$, $u$ - вершина, $\deg u = \xi$

$p = \frac{1}{n}\ G(n, p)\ P(\exists u: \deg u \ge \frac{\ln n}{\ln\ln n}) \ge c > 0$ \\
$c = 1 - e^{-\frac{1}{e}}$

** Теорема Эрдём Рейли
$p = c\frac{\ln n}{n} + \frac{d}{n}$ \\
1. $c < 1 \Rightarrow G$ а.п.н не связен
2. $c > 1 \Rightarrow G$ а.п.н связен
3. $c = 1 \Rightarrow G$ связен ассимпотически с вероятностью $e^{-e^{-d}}$

** Теорема об изолированных вершинах
$p = c\frac{\ln n}{n}$
1. $c < 1 \Righarrow$ а.п.н $\exists v: \deg v = 0$
2. $c > 1 \Righarrow$ а.п.н $\forall v: \deg v > 0$

** Заметки
- Дисперсия
  $D\xi = E(\xi^2) - (E\xi)^2$
- Неравенство Маркова \\
  $P(\xi > cE\xi) \le \frac{1}{c}$
- Неравенство Чернова \\
  $P(|\xi - E\xi| \ge c) \le \frac{D\xi}{c^2}$
- Треугольники \\
  $P(T_{n,p} = 0) \le P(|T_{n,p} - ET_{n,p}| \ge |ET_{n,p}|)$
- Предел
  $(1 \pm \frac{1}{n})^n \to e^{\pm 1}$
