Term3/discrete/hws/kr3.tex
% Created 2020-11-25 Wed 11:44
% Intended LaTeX compiler: pdflatex
\documentclass{article}
       \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[russian, english]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
       
       \usepackage{geometry}
       \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Test \#3}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Test \#3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Test \#3 (Случайные графы)}
\label{sec:org3eccbd9}
Модель \(G(n, p)\), размер вероятностного пространства \(2^{n \choose 2}\) \\
Вероятность графа из \(m\) ребер \(p^mq^{ {n \choose 2} - m}\) \\
Пороговая вероятность свойства \(A\) графа \(G(n, p)\) - \(t(n)\)
\begin{itemize}
\item \(p(n) = o(t(n))\) - \(A\) а.п.н не выполнятеся
\item \(p(n) = \omega(t(n))\) - \(A\) а.п.н выполнятеся
\end{itemize}
\subsection{Метод 1 момента}
\label{sec:org29010ea}
\[ A = \{G \mid x \in G\} \]
\emph{\(x\) - например треугольники} \\
\(X\) - колтчество \(x\) в графе \(G\) \\
Если \(EX \to 0\), то \(A\) а.п.н не выполнено
\subsection{Метод 2 момента}
\label{sec:org4b3b725}
\(P(|X - EX| \ge EX) \le \frac{DX}{(EX)^2}\) \\
Если \(EX \to \infty\), хотим чтобы \(\frac{DX}{(EX)^2} \to 0\), 
если выполнено то \(A\) а.п.н выполнено
\begin{gather*}
DX = E(X^2) - (EX)^2 \\
\frac{DX}{(EX)^2} = \frac{E(X^2) - (EX)^2}{(EX)^2} = \frac{E(X^2)}{(EX)^2} - 1 \\
E(X^2) = (EX)^2(1 + \underbrace{o(1)}_{\to 0})
\end{gather*}
\subsection{Распределение степеней вершин}
\label{sec:orgdbc0a88}
Граница Чернова
\emph{Пример нечестной монеты: 1 с вероятностью \(p\), 0 с вероятностью \(q\)} \\
\emph{\(pn\) - мат. ожидание количества единиц}
\[ P(|\xi - np| \ge \alpha\sqrt{np}) \le 3e^{-\frac{\alpha^2}{8}} \]
, где \(\xi = \sum_{i=1}^n \xi_i,\ \xi_i = \begin{cases} 1, p \\ 0, q \end{cases}\)

\(p = const\), \(u\) - вершина, \(\deg u = \xi\)

\(p = \frac{1}{n}\ G(n, p)\ P(\exists u: \deg u \ge \frac{\ln n}{\ln\ln n}) \ge c > 0\) \\
\(c = 1 - e^{-\frac{1}{e}}\)

\subsection{Теорема Эрдём Рейли}
\label{sec:org01932b3}
\(p = c\frac{\ln n}{n} + \frac{d}{n}\) \\
\begin{enumerate}
\item \(c < 1 \Rightarrow G\) а.п.н не связен
\item \(c > 1 \Rightarrow G\) а.п.н связен
\item \(c = 1 \Rightarrow G\) связен ассимпотически с вероятностью \(e^{-e^{-d}}\)
\end{enumerate}

\subsection{Теорема об изолированных вершинах}
\label{sec:org869e774}
\(p = c\frac{\ln n}{n}\)
\begin{enumerate}
\item \(c < 1 \Righarrow\) а.п.н \(\exists v: \deg v = 0\)
\item \(c > 1 \Righarrow\) а.п.н \(\forall v: \deg v > 0\)
\end{enumerate}

\subsection{Заметки}
\label{sec:org44edf24}
\begin{itemize}
\item Дисперсия
\(D\xi = E(\xi^2) - (E\xi)^2\)
\item Неравенство Маркова \\
\(P(\xi > cE\xi) \le \frac{1}{c}\)
\item Неравенство Чернова \\
\(P(|\xi - E\xi| \ge c) \le \frac{D\xi}{c^2}\)
\item Треугольники \\
\(P(T_{n,p} = 0) \le P(|T_{n,p} - ET_{n,p}| \ge |ET_{n,p}|)\)
\item Предел
\((1 \pm \frac{1}{n})^n \to e^{\pm 1}\)
\end{itemize}
\end{document}
